//** @file
//   Strings for BIOS Event Log Config utility DXE
//
//;******************************************************************************
//;* Copyright (c) 2016, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"

#string STR_BLANK_STRING                                                   #language en-US " "
                                                                           #language fr-FR " "
                                                                           #language zh-TW " "
                                                                           #language ja-JP " "
                                                                           #language it-IT " "
                                                                           #language es-ES " "
                                                                           #language de-DE " "
                                                                           #language pt-PT " "	
#string STR_DISABLED_TEXT                                                  #language en-US "Disabled"
                                                                           #language fr-FR "Désactiver"
                                                                           #language zh-TW "\wide停用\narrow"
                                                                           #language ja-JP "\wide使用しない\narrow"
                                                                           #language it-IT "Disabilitato"
                                                                           #language es-ES "inhabilitado"
                                                                           #language de-DE "Sperren"
                                                                           #language pt-PT "Proibir"
#string STR_ENABLED_TEXT                                                   #language en-US "Enabled"
                                                                           #language fr-FR "Activer"
                                                                           #language zh-TW "\wide啟用\narrow"
                                                                           #language ja-JP "\wide使用する\narrow"
                                                                           #language it-IT "abilitato"
                                                                           #language es-ES "permitido"
                                                                           #language de-DE "Aktivieren"
                                                                           #language pt-PT "Permitir"
#string STR_CLAER_TEXT                                                     #language en-US "Clear conditions"
#string STR_BIOS_EVENT_LOG_CONFIG_UTIL_FORMSET                             #language en-US "BIOS Event Log Config Utility"
#string STR_BIOS_EVENT_LOG_CONFIG_UTIL_FORMSET_HELP                        #language en-US "Show Event Log Configuration and Viewer."
#string STR_NAME_VALUE_VAR_NAME0                                           #language en-US "MyNameValue0"

//
// Form VFR_FORMID_BIOS_EVENT_LOG_CONFIG_PAGE
//
#string STR_BIOS_EVENT_LOG_CONFIG_PAGE                                     #language en-US "BIOS Event Log Configuration"
#string STR_BIOS_EVENT_LOG_CONFIG_PAGE_HELP                                #language en-US "Show BIOS Event Log Configuration"

//
// Log Event To
//
#string STR_LOG_EVENT_TO_STRING                                            #language en-US "Log Event To"
#string STR_LOG_EVENT_TO_HELP                                              #language en-US "Setting Events  to Log Selected Storage"
#string STR_BIOS_TXT                                                       #language en-US "BIOS"
#string STR_BMC_SEL_TXT                                                    #language en-US "BMC SEL"
#string STR_MEMORY_TXT                                                     #language en-US "MEMORY"
#string STR_ALL_TXT                                                        #language en-US "ALL"

//
// Event Log Full option
//
#string STR_EVENT_LOG_FULL_OPTION_STRING                                   #language en-US "Event Log Full option"
#string STR_EVENT_LOG_FULL_OPTION_HELP                                     #language en-US "Overwrite: Overwrite the oldest event data with newer ones. Clear All: Clear ALL event data. Stop Logging: Stop logging event data."
#string STR_OVERWRITE_TEXT                                                 #language en-US "Overwrite"
#string STR_CLEAR_ALL_TEXT                                                 #language en-US "Clear All"
#string STR_STOP_LOGGING_TEXT                                              #language en-US "Stop Logging"
#string STR_BMC_SEL_NOT_SUPPORT_OVERWRITE_TEXT                             #language en-US "BMC SEL doesn't support OVERWRITE option."

//
// Form VFR_FORMID_BIOS_EVENT_LOG_EVENT_AND_MESSAGE_PAGE
//
#string STR_BIOS_EVENT_LOG_VIEWER_PAGE                                     #language en-US "BIOS Event Log Viewer"
#string STR_BIOS_EVENT_LOG_VIEWER_PAGE_HELP                                #language en-US "Show BIOS Event Log Viewer"
#string STR_BIOS_EVENT_LOG_VIEWER_SHOW_EVENT                               #language en-US "Show BIOS Event Log"
#string STR_BIOS_EVENT_LOG_VIEWER_SHOW_EVENT_HELP                          #language en-US "Select the Event Storage to show the events of it."
#string STR_BIOS_EVENT_LOG_VIEWER_CLEAR_EVENT                              #language en-US "Clear Event Log"
#string STR_BIOS_EVENT_LOG_VIEWER_CLEAR_EVENT_HELP                         #language en-US "Select the Event Storage to clear the events of it."

//
// Filter setting
//
#string STR_FILTER_SETTING_STRING                                          #language en-US "Filter setting"
#string STR_FILTER_SETTING_HELP                                            #language en-US "Enable / Disable Filter setting"
#string STR_DATE_FILTER_CONDITION_PROMPT                                   #language en-US "-Date"
#string STR_DATE_FILTER_CONDITION_HELP                                     #language en-US "Date setting for filter condition. (ex. 2015/01/01)"
#string STR_TIME_FILTER_CONDITION_PROMPT                                   #language en-US "-Time"
#string STR_TIME_FILTER_CONDITION_HELP                                     #language en-US "Time setting for filter condition. (ex. 03:21:58)"
#string STR_GENERATOR_ID_FILTER_CONDITION_PROMPT                           #language en-US "-Generator ID"
#string STR_GENERATOR_ID_FILTER_CONDITION_HELP                             #language en-US "Generator ID setting for filter condition. (ex. 0x0020)"
#string STR_EVENT_ID_FILTER_CONDITION_PROMPT                               #language en-US "-Event ID"
#string STR_EVENT_ID_FILTER_CONDITION_HELP                                 #language en-US "Event ID setting for filter condition. (ex. 0x0F 0x00 0x6F)"
#string STR_SENSOR_TYPE_FILTER_CONDITION_PROMPT                            #language en-US "-Sensor Type"
#string STR_SENSOR_TYPE_FILTER_CONDITION_HELP                              #language en-US "Sensor Type setting for filter condition. (ex. 0x02)"
#string STR_SENSOR_NUMBER_FILTER_CONDITION_PROMPT                          #language en-US "-Sensor Number"
#string STR_SENSOR_NUMBER_FILTER_CONDITION_HELP                            #language en-US "Sensor Number setting for filter condition. (ex. 0x06)"
#string STR_EVENT_TYPE_FILTER_CONDITION_PROMPT                             #language en-US "-Event Type"
#string STR_EVENT_TYPE_FILTER_CONDITION_HELP                               #language en-US "Event Type setting for filter condition. (ex. 0x6F)"
#string STR_EVENT_TYPE_ID_FILTER_CONDITION_PROMPT                          #language en-US "-Event Type ID"
#string STR_EVENT_TYPE_ID_FILTER_CONDITION_HELP                            #language en-US "Event Type ID setting for filter condition. (ex. 0x02)"
#string STR_STRING_FILTER_CONDITION_PROMPT                                 #language en-US "-String"
#string STR_STRING_FILTER_CONDITION_HELP                                   #language en-US "String setting for filter condition. (ex. Test)"

#string STR_NO_STORAGE_EXISTS                                              #language en-US "There is no Event Storage existed."
#string STR_SELECT_EVENT_STORAGE                                           #language en-US "Select the Event Storage:"
#string STR_SAVE_ALL_EVENTS                                                #language en-US "All"
#string STR_SAVE_CURRENT_EVENTS                                            #language en-US "Current"
#string STR_SAVE_EVENT_HELP                                                #language en-US "Save All Events or Save Current Page Events."
#string STR_NO_EVENT_EXISTS                                                #language en-US "There is no Event Log existed."
#string STR_SAVE_EVENT_FAILURE                                             #language en-US "Save Event Log failure."
#string STR_SHOW_EVENT_PREVIOUS_PAGE                                       #language en-US "Show Previous Page Events"
#string STR_SHOW_EVENT_NEXT_PAGE                                           #language en-US "Show Next Page Events"

//
// End of file
//